el_room_tuple = (
    '大床', '豪华', '标准间', '无窗', '标准', '套房', '商务', '单人间', '双床', '普通', '双人间', '三人间', '家庭', '标间', '单间', '电脑', '特惠', '双人房',
    '单人房',
    '高级', '人间', '温馨', '主题', '特价', '床位', '内宾', '海景', '麻将', '舒适', '精品', '行政', '圆床', '公卫', '电脑房', '三人房', '双床间', '棋牌', '情侣',
    '经济', '空调', '浪漫', '套间', '精致', '别墅', '榻榻米', '景观', '观景', '时尚', '一厅', '双人', '卫浴', '女生', '阳台', '公共', '阳光', '特色', '子房',
    '男生',
    '客房', '亲子', '复式', '风情', '一室', '欧式', '休闲', '江景', '山景', '精选', '卧室', '雅致', '数码', '公寓', '钟点房', '四人房', '电视', '四人', '两室',
    '迷你', '单人', '小时', '蜜月', '娱乐', '三人', '普间', '花园', '两房一厅', '园景', '自主', '海景房', '一房一厅', '限时', '湖景', '传统', '双标', '床房',
    '火炕',
    '地中海', '零压', '经典', '二人', '度假', '18', '三床', '庭院', '日式', '二厅', '水床', '预付', '温泉', '田园', '单床', '简约', '中式', '景房', '独卫',
    '独立',
    '二室', '无敌', '木屋', 'gt', '促销', '至尊', 'lt', '六人', '星空', '机麻', '二楼', '总统套房', '阁楼', '情趣', '发票', '清新', '两厅', '露台', '影院',
    '零室', '六人房', '独栋', '抢购', '大标间', '一楼', '含早', '梦幻', '公主', '限量', '人大', '帐篷', '土炕', '浴缸', '机麻房', '优选', '双标间', '三室一厅',
    '今日',
    '尊享', '全景', '夫妻', '电动', '临河', '精装', '贵宾', '人房', '15', '园景大床', '号楼', '奢华', '米大床', '藏式', '北欧', '美式', '棋牌室', '居室',
    '抢订',
    'vip', '韩式', '假日', '房一厅', '海洋', '湖景大床', '优享', '电影', '双卧', '时光', '现代', '复式房', '之恋', 'loft', '城景', '影视', '标房', 'or',
    '婚房',
    '古典', '三房一厅', '观海', '双人床', '尊贵', '太空舱', '森林', '体验', '三室两厅', '一卫', 'kitty', '主楼', '专享', '整栋', '三室', '卫浴间', '有窗',
    '风格',
    '商旅', '临江', '小标间', '超值', '内窗', '混住', '180', '八人', '典雅', '子母', '蓝色', '上下', '玫瑰', '复古', '贵宾楼', '双大床', '男女', '卫生间',
    '精品房',
    '单标', '两居室', '城市', '夫妻间', '优品', '超级', '跃层', '一线', '三房两厅', '四室', '连住', '两房', '欢乐', '阳光房', '10', '混合', '智能', '个性',
    '厅房',
    '河景', '激情', '全新', '街景', '飘窗', '五人', '格调', '高层', '世界', '八人房', '四房', '三居室', '入住', '投影', '蒙古包', 'hello', '小木屋', '单人床',
    '沙发', '三房', '精装修', '甜蜜', '市景', '三楼', '两房两厅', '201', '大圆', '系列', '洋房', '落地窗', '皇冠', '沙发床', '泳池', '3d', '米床', '五房',
    '空间',
    '单早', '粉色', '以上', '五人房', '202', '轻奢', '超大', '满屋', '普通家庭', '特大', '城景大床', '民宿', '女神', '部分', '小屋', 'hellokitty', '青春',
    '房含', '预订', '一厨', '独卫大床', '养生', '公卫无窗', '12', 'in', '无烟', '乡村', '雕花', '地暖', '英伦', '203', '艺术', '优雅', '海底', '东南亚',
    '百合',
    '农家', '二床', '高档', '紫色', '印象', '影音', '日出', '小院', '雪山', '唯美', '101', '优惠', '宿舍', '二居室', '一号', '床单', '私人', '一房', '晚及',
    '惠选大床', '主卧', '夜景', '别院', '标双', '民俗', '三餐', '都市', '东北', '开间', '床大床', '贵宾房', '二号', '房间', '临水', '升级', '幸福', '情调',
    '携手',
    '精美', '风尚', '多人', '中宾', '园林', '102', '二房', '海大', '法式', '会员', '两居', '270', '景大床', '禅意', '301', '希岸', '闺蜜', '猪猪',
    '无早',
    '床间', '明清', '号房', '客厅', '标单', '绿野仙踪', '两卫', '六房', '吸烟', '总统', '洗浴', '临海', '睡眠', '粉红', '沙漠', '包场', '302', '惠选', '定制',
    '健康', '手机', '厅室', '迎宾', '爱情', '私享', '四合院', '酒店', '山水', '无独卫', '乐享', '樱花', '花园别墅', '泰式', '生态', '小床', '渔家', '包栋',
    '情景',
    '邂逅', '洲际', '绿色', '提前', '五室', '爱琴海', '房车', '特优', '私密', '位房', '单标间', '罗马', '特享', '租房', '内景', '简欧', '网络', '风景', '号院',
    '城堡', '房型', '聚会', '二卫', '观影', '清雅', '专供', '男神', '露营', '豪标', '单房', '楼中楼', '楼层', '品质', '卡通', '蓝天', '工业', '免费', '河景大床',
    '智选', '侠酷', '临街', '多人房', '厨房', '雅房', '五折', '居家', '开放式', '一居', '普标', '103', '山海', '双拼', '客栈', '净馨', '炕房', '独卫房',
    '机麻大床',
    '一日三餐', '205', '巴黎', '红色', '云天', '负离子', '空中', '炕间', '实惠', '文艺', '优质', '市景大床', '横舱', '高低', '巨幕', '单卧', '音乐', '纳西',
    'mini', '普罗旺斯', '海岸', '温情', '恋人', '精英', '新品', '薰衣草', '创意', '售卖', '今夜', '四季', '吊篮', '公用', '北楼', '两人', '酷芽', '景致',
    '高尔夫',
    '小房', '房无窗', 'iu', '院景', '秒杀', '南楼', '点至', '景区', '午夜', '俱乐部', '熊猫', '豪单', '母子', '幽梦', '上铺', '特级', '淋浴间', '303',
    '嘉宾',
    '水景', '江南', '女士', '之约', '11', '庄园', '情迷', '回忆', '宽敞', '下铺', '整租', 'spa', '分店', '原木', '携程', '窑洞', '皇家', '舒享', '三卧',
    '婚庆',
    '联排', '土家', '汽车', '天空', '爱情海', '半山', '青年', '遇见', '暗窗', '窗大床', 'ktv', '异域', '旅行', '奇缘', '海边', '尊爵', '氧吧', '宜家', '苍山',
    '明窗', '民族', '背包', '别致', '概念', '小筑', '彩虹', '记忆', '儿童', '湖畔', '五居', '一帘', '竖舱', '泡池', '花语', '风雅', '岁月', '古韵', '正面',
    '方床',
    '丛林', '尊荣', '亲情', '汤屋', '二店', '时代', '三居', '大窗', '四床', '江湖', '中国', '太空', '二号楼', '童趣', '心心相印', '双早', '天使', '西楼', '几木',
    '飞侠', '怀旧', '迷情', '驴友', '风大床', '单身公寓', '公馆', '连通', '滑梯', '卧房', 'bigger', '童话', '206', '浴室', '雅居', '十人', '商务楼',
    '两人房',
    '普单', '舒心', '海湾', '三房二厅', '月租', '子母间', '驿居', '电梯', '204', '景酒', '智慧', '沙滩', '河畔', '明月', '生活', '1800', '尊尚', '20',
    '外窗',
    '近海', '三厅', '佳人', '面海', '东楼', '龙凤', '800', '新春', '情缘', '实木', '三号', '机酒', '家居', '观山', '斜顶', '静谧', '18m', '后院', '落地',
    '天窗', '附楼', '学生', '快捷', '快乐', '点到', '乐活', '套餐', '通铺', '湾景', '风扇', '之夜', '半岛', '冰雪', '冲浪', '玲珑', '丽致', '一大', '小型',
    '春季',
    '十二', '整套', '蜗居', '物语', '风暴', '随机', '望江', '景双床', '青旅', '楼大床', '私汤', '次品', '书香', '清风', '缤纷', '旅行社', '水晶', '东方', '港湾',
    '无卫', '家庭式', '艺起', 'kt', '楼房', '花好月圆', '乐园', '秋千', '情人', '木楼', '观星', '小镇', '淋浴', '一个', '荷塘月色', '无障碍', '14', '幸运',
    '不带',
    '百元', '24', '君悦', '漫步', '周末', '私家', '套二', '亲水', '大使', '自助', '免房', '畅游', '碧海', '希尔顿', '99', '含三人', '包房', '米奇', '特选',
    '门票', '夏日', '竹林', '格大床', '折扣', '悦享', '高端', '远景', '朝阳', '房大床', '胶囊', '之旅', '倾城', '雪景', '山居', '凯悦', '挪威', '初见', '二期',
    '海港', '空气净化', '国际', 'villa', '尚品', '白天', '电炕', '接送', '动漫', '极致', '古城', '拾光', '无法', '点连住', '厢房', '独院', '暑期', 'love',
    '合家欢', '踏青', '美景', '洱海', '星座', '诱惑', '六室', '号店', '15m', '世界杯', '暖气', '四楼', '空气清新', '架子床', '宫廷', '冬季', '江浙沪', '壹号',
    '一米阳光', '听涛', '母子间', '茶艺', '暖冬', '抢无窗', '经济型', '16', '家园', '双层', '文化', '月光', '复式楼', '山溪', '特大号', '平房', '狂欢', '恒温',
    '故事',
    '享大床', '钻石', '人家', '悠然', '温暖', '天内', '凤凰', '白族', '顶级', '生日', '30', '贵族', '草原', '池畔', '临湖', '天字', '富力泉', '皮床', '房带',
    '任选', '小区', '双房', '浓情', '公寓楼', '莉馨', '天台', '星光', '非繁', '新楼', '摩登', '七房', '秘密', '花样年华', '购房', '旅游', '开业', '红木', '侧面',
    '控房', '经济舱', '900', '魅力', '两卧', '明亮', '按摩', '元素', '带加床', '王子', '树屋', '楼标间', '动感', '包层', '环保', '清凉', '静雅', '户型',
    '听海',
    'style', '一夏', '105', '黄人', '轻奢大床', '宾馆', '山庄', '皇室', '露天', '22', '限购', '一层', '起租', '烟雨', '蝶恋花', '一生', '305', '水岸',
    '订制', '丝路之旅', '地下', '一期', '独享', '价格', 'ins', '迪士尼', '异国', '前院', '安静', '吊脚楼', '地下室', '平米', '城品', '两床', '游戏', '二居',
    '雨林',
    '曼享', '机麻间', '设计', '顶楼', '90', '威斯汀', '不含税', '外滩', '舱房', '烧烤', '公寓式', '背包客', '威尼斯', '神秘', '好莱坞', '花房', '别苑', '王国',
    '会馆',
    '相思', '电扇', '整幢', '包院', '水上', '欧美', '巴厘岛', '民族特色', '小窗', '旅程', '舱位', '塌塌米', '简爱', '多功能', '海豚', '庭园', '丽景', '小窝',
    '玻璃',
    '民居', '山顶', '古镇', '云端', '院落', '全家福', '金秋', '星星', '儿童房', '大型', '木质', '听雨', '黑白', '星月', '13', 'amp183', '两大床', '海贼王',
    '室内', '收费', '看海', '卧大床', '醇享', '家庭影院', '四星', '窗房', '爱心', '蔚蓝', '逸林', '四人雅房', '朝南', '大促', '水晶之恋', '如意', '情怀', '中庭',
    '度全',
    '二馆', '另付', '安逸', '大厅', '金沙滩', '大标', '旅游节', '正房', '雅阁', '蒸汽', '一店', '海棠', '过夜', '甩卖', '一人', '格双床', '三卫')


def el_features_mapping(spl_text: str, s_text: str) -> float:
    # 计算原长
    spl_string_len = len(spl_text)
    s_string_len = len(s_text)

    spl_word_set = set()
    s_word_set = set()
    # 装载字典
    for word in el_room_tuple:
        if word in spl_text:
            spl_word_set.add(word)
            spl_text = spl_text.replace(word, '', 1)
        if word in s_text:
            s_word_set.add(word)
            s_text = s_text.replace(word, '', 1)

    spl_length = spl_string_len * len(spl_word_set)
    s_length = s_string_len * len(s_word_set)
    print(spl_word_set, s_word_set)
    return min(spl_length / s_length, s_length / spl_length)


res = el_features_mapping(spl_text='豪华大床房包层', s_text='豪华大床')
print(res)