"""

问题提出

    一个几何平面上有 N 个点，
    根据欧氏（欧几里得）几何原理，
    每两个点可以连成一条直线，
    N 个点可以连成很多条直线。
    当然，也会有多个点共线的情况出现，
    现在我们的问题是，在这 N 个点中，
    找出哪两个点组成的直线上包含最多的点，
    也就是找出含有最多点的那条直线。

注意浮点数不要直接比较值相等

解题思路

    确定一个点为原点
    其他点过原点的斜率计算
    统计出斜率频次并取最大，并记录
    依次遍历点作为原点，重复上面操作
    从记录的频次列表中
    求得最大的即为含有最多点的那条直线。

输入：
list[tuple...]

输出：
int

"""

from collections import Counter


def get_most_count(spot_list):
    res = set()
    for j in range(len(spot_list)):
        tmp = list()
        for i, spot in enumerate(spot_list):

            if j == i:
                continue
            x, y = spot
            x0, y0 = spot_list[j]
            # 注意x==x0时的情况为斜率不存在
            if (x - x0) != 0:
                tmp.append(format((y - y0) / (x - x0), '.8f'))
            else:
                tmp.append(float("inf"))
        res.add(max(Counter(tmp).values()))
    return max(res) + 1


lst = [(1, 1), (2, 2), (3, 3), (6, 6), (0, 0), (1, 5), (1, 6), (1, 7), (1, 3), (1, 2), (1, 1), (2, 2), (3, 3), (6, 6),
       (0, 0), (1, 5), (1, 6), (1, 7), (1, 3), (1, 2), (1, 1), (2, 2), (3, 3), (6, 6), (0, 0), (1, 5), (1, 6), (1, 7),
       (1, 3), (1, 2), (1, 1), (2, 2), (3, 3), (6, 6), (0, 0), (1, 5), (1, 6), (1, 7), (1, 3), (1, 2), (1, 1), (2, 2),
       (3, 3), (6, 6), (0, 0), (1, 5), (1, 6), (1, 7), (1, 3), (1, 2), (1, 1), (2, 2), (3, 3), (6, 6), (0, 0), (1, 5),
       (1, 6), (1, 7), (1, 3), (1, 2)]
s = get_most_count(lst)
print(len(lst))
print(s)
